// Обработка добавляет в табличную часть новый реквизит, для внесения новой цены отличной от прайса _(
&НаСервере
Процедура РасшРТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// Добавляем новый реквизит "ЦенаСоСкидкой"
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ЦенаСоСкидкой", Новый ОписаниеТипов("Число" ,,, Новый КвалификаторыЧисла(15, 2)), "Объект.Товары", "Цена для клиента", Ложь));
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);  
	// Добавляем новый элемент
	НовыйЭлемент  = Элементы.Вставить("ТоварыЦенаСоСкидкой", Тип("ПолеФормы"), Элементы.Товары, Элементы.ТоварыПроцентАвтоматическойСкидки);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.ЦенаСоСкидкой";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "РасшРТ_ЦенаСоСкидкойПриИзменении");
КонецПроцедуры

&НаКлиенте
Процедура РасшРТ_ПриОткрытииПосле(Отказ)
	РасшРТ_РассчитатьЦенуСоСкидкойВСтроках();
КонецПроцедуры

&НаКлиенте
Процедура РасшРТ_ЦенаСоСкидкойПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.СуммаРучнойСкидки = (ТекущиеДанные.Цена - ТекущиеДанные.ЦенаСоСкидкой) * ТекущиеДанные.КоличествоУпаковок;
	ТоварыСуммаРучнойСкидкиПриИзменении(Элементы.ТоварыСуммаРучнойСкидки);
КонецПроцедуры

&НаКлиенте
Процедура РасшРТ_РассчитатьЦенуСоСкидкой(ТекущиеДанные)
	ТекущиеДанные.ЦенаСоСкидкой = ТекущиеДанные.Цена - (ТекущиеДанные.СуммаРучнойСкидки / ТекущиеДанные.КоличествоУпаковок); 
КонецПроцедуры

&НаКлиенте
Процедура РасшРТ_РассчитатьЦенуСоСкидкойВСтроках()
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		РасшРТ_РассчитатьЦенуСоСкидкой(СтрокаТЧ);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РасшРТ_ТоварыСуммаРучнойСкидкиПриИзмененииПосле(Элемент)
	РасшРТ_РассчитатьЦенуСоСкидкой(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура РасшРТ_ТоварыПроцентРучнойСкидкиПриИзмененииПосле(Элемент)
	РасшРТ_РассчитатьЦенуСоСкидкой(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура РасшРТ_ТоварыСуммаПриИзмененииПосле(Элемент)
	РасшРТ_РассчитатьЦенуСоСкидкой(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура РасшРТ_ТоварыЦенаПриИзмененииПосле(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;  	
	Если  НЕ ЗначениеЗаполнено(ТекущиеДанные.ЦенаСоСкидкой) Тогда
		ТекущиеДанные.ЦенаСоСкидкой = ТекущиеДанные.Цена;
	КонецЕсли;
	РасшРТ_ЦенаСоСкидкойПриИзменении(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура РасшРТ_ТоварыВидЦеныПриИзмененииПосле(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;  
	Если  НЕ ЗначениеЗаполнено(ТекущиеДанные.ЦенаСоСкидкой) Тогда
		ТекущиеДанные.ЦенаСоСкидкой = ТекущиеДанные.Цена;
	КонецЕсли;
	ТекущиеДанные.Сумма = ТекущиеДанные.ЦенаСоСкидкой * ТекущиеДанные.КоличествоУпаковок;
КонецПроцедуры
// _)